app/controllers/v1/addresses_controller.rb

    def index
      @address = @user.addresses.all.limit(5)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 5]]

    def create
      @address = @user.addresses.new(address_params)
      if @address.save
---
INSERT INTO "addresses" ("user_id", "phone", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["phone", "Hurray"], ["country", "2012-12-22T01:00"], ["created_at", "2018-05-26 14:09:17.994163"], ["updated_at", "2018-05-26 14:09:17.994163"]]

    def find_user
      @user = User.find_by_id(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]