app/controllers/v1/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 5]]
---
    def index
      @comments = @user.comments.all.limit(5)

INSERT INTO "comments" ("user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["title", "Comment Title"], ["created_at", "2018-05-26 14:33:48.242282"], ["updated_at", "2018-05-26 14:33:48.242282"]]
---
    def create
      @comment = @user.comments.new(comment_params)
      if @comment.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_user
      @user = User.find_by_id(params[:user_id])