app/controllers/v1/tweets_controller.rb

    def index
      @tweets = @user.tweets.all.limit(5)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]

    def create
      @tweet = @user.tweets.new(tweet_params)
      if @tweet.save
---
INSERT INTO "tweets" ("user_id", "text", "scheduled_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["text", "Hurray, I've survived"], ["scheduled_at", "2012-12-22 01:00:00"], ["created_at", "2018-05-26 11:22:53.243515"], ["updated_at", "2018-05-26 11:22:53.243515"]]

    def find_user
      @user = User.find_by_id(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]