app/controllers/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
      # Should use find_by_id(:id), instead of find(:id)
      @user = User.find_by_id(params[:id])